Repository: Leleocastro/onitama-game
Catalog: lib/l10n/app_*.arb
Languages: es, pt

source: Hello
es: Hola
pt: Olá

# onitama
source: Masters of Onitama
es: Maestros de Onitama
pt: Mestres de Onitama

# gameOfTheMasters
source: The Game of the Masters
es: El Juego de los Maestros
pt: O Jogo dos Mestres

source: Local Multiplayer
es: Multijugador Local
pt: Multijogador Local

source: Player vs AI
es: Jugador vs IA
pt: Jogador vs IA

source: Online Multiplayer
es: Multijugador en Línea
pt: Multijogador Online

source: Private Game
es: Partida Privada
pt: Jogo Privado

source: Create Online Game
es: Crear Partida en Línea
pt: Criar Jogo Online

source: Game ID
es: ID de la Partida
pt: ID do Jogo

source: Join Online Game
es: Unirse a Partida en Línea
pt: Entrar em Jogo Online

source: How to Play
es: Cómo Jugar
pt: Como Jogar

source: Select Difficulty
es: Seleccionar Dificultad
pt: Selecionar Dificuldade

source: Easy
es: Fácil
pt: Fácil

source: Medium
es: Medio
pt: Médio

source: Hard
es: Difícil
pt: Difícil

source: Matchmaking
es: Buscando Partida
pt: Procurando Partida

source: Waiting for an opponent...
es: Esperando a un oponente...
pt: Esperando por um oponente...

# howToPlayTitle
source: How to Play
es: Cómo Jugar
pt: Como Jogar

# onitamaDescription
source: Onitama is a two-player abstract strategy game with a unique movement mechanic.
es: Onitama es un juego de estrategia abstracto para dos jugadores con una mecánica de movimiento única.
pt: Onitama é um jogo de estratégia abstrato para dois jogadores com uma mecânica de movimento única.

# objectiveTitle
source: Objective
es: Objetivo
pt: Objetivo

# objectiveDescription
source: There are two ways to win:
es: Hay dos formas de ganar:
pt: Existem duas maneiras de vencer:

# wayOfTheStone
source: 1. Way of the Stone: Capture your opponent's Master pawn.
es: 1. Camino de la Piedra: Captura el peón Maestro de tu oponente.
pt: 1. Caminho da Pedra: Capture o peão Mestre do seu oponente.

# wayOfTheStream
source: 2. Way of the Stream: Move your Master pawn to your opponent's starting Temple Arch space.
es: 2. Camino del Arroyo: Mueve tu peón Maestro al espacio del Arco del Templo inicial de tu oponente.
pt: 2. Caminho do Riacho: Mova seu peão Mestre para o espaço do Arco do Templo inicial do seu oponente.

# setupTitle
source: Setup
es: Configuración
pt: Configuração

# setupDescription1
source: 1. Each player starts with five pawns: one Master and four Students.
es: 1. Cada jugador comienza con cinco peones: un Maestro y cuatro Estudiantes.
pt: 1. Cada jogador começa com cinco peões: um Mestre e quatro Alunos.

# setupDescription2
source: 2. Pawns are placed on the 5x5 board in their starting positions.
es: 2. Los peones se colocan en el tablero de 5x5 en sus posiciones iniciales.
pt: 2. Os peões são colocados no tabuleiro 5x5 em suas posições iniciais.

# setupDescription3
source: 3. Each player receives two random Move cards.
es: 3. Cada jugador recibe dos cartas de Movimiento aleatorias.
pt: 3. Cada jogador recebe duas cartas de Movimento aleatórias.

# setupDescription4
source: 4. One extra card is placed on the side of the board.
es: 4. Se coloca una carta extra al costado del tablero.
pt: 4. Uma carta extra é colocada ao lado do tabuleiro.

# gameplayTitle
source: Gameplay
es: Jugabilidad
pt: Jogabilidade

# gameplayDescription
source: On your turn, you must perform the following steps:
es: En tu turno, debes realizar los siguientes pasos:
pt: No seu turno, você deve realizar os seguintes passos:

# gameplayStep1
source: 1. Choose one of your two Move cards.
es: 1. Elige una de tus dos cartas de Movimiento.
pt: 1. Escolha uma de suas duas cartas de Movimento.

# gameplayStep2
source: 2. Move one of your pawns according to the selected card.
es: 2. Mueve uno de tus peones según la carta seleccionada.
pt: 2. Mova um de seus peões de acordo com a carta selecionada.

# gameplayStep3
source: 3. The card you used is then exchanged with the card on the side of the board.
es: 3. La carta que usaste se intercambia con la carta al costado del tablero.
pt: 3. A carta que você usou é então trocada com a carta ao lado do tabuleiro.

# movementTitle
source: Movement
es: Movimiento
pt: Movimento

# movementDescription1
source: - The black square on a Move card represents the pawn's current position.
es: - El cuadrado negro en una carta de Movimiento representa la posición actual del peón.
pt: - O quadrado preto em uma carta de Movimento representa a posição atual do peão.

# movementDescription2
source: - The colored squares show the possible moves from that position.
es: - Los cuadrados de colores muestran los posibles movimientos desde esa posición.
pt: - Os quadrados coloridos mostram os movimentos possíveis a partir dessa posição.

# movementDescription3
source: - You cannot move a pawn off the board or onto a space occupied by your own pawn.
es: - No puedes mover un peón fuera del tablero o a un espacio ya ocupado por uno de tus propios peones.
pt: - Você não pode mover um peão para fora do tabuleiro ou para um espaço já ocupado por um de seus próprios peões.

# capturingTitle
source: Capturing
es: Captura
pt: Captura

# capturingDescription
source: If you move a pawn to a square occupied by an opponent's pawn, the opponent's pawn is captured and removed from the game.
es: Si mueves un peón a un cuadrado ocupado por un peón del oponente, el peón del oponente es capturado y eliminado del juego.
pt: Se você mover um peão para um quadrado ocupado por um peão do oponente, o peão do oponente é capturado e removido do jogo.

source: Loading...
es: Cargando...
pt: Carregando...

source: Game Over
es: Fin del Juego
pt: Fim de Jogo

source: Exit
es: Salir
pt: Sair

source: Restart
es: Reiniciar
pt: Reiniciar

source: You
es: Tú
pt: Você

source: Opponent
es: Oponente
pt: Oponente

source: Restart Game
es: Reiniciar Juego
pt: Reiniciar Jogo

# areYouSureRestart
source: Are you sure you want to restart the game?
es: ¿Estás seguro de que quieres reiniciar el juego?
pt: Tem certeza de que deseja reiniciar o jogo?

source: Cancel
es: Cancelar
pt: Cancelar

source: Surrender
es: Rendirse
pt: Render-se

source: Surrender Game
es: Rendirse
pt: Render-se

# areYouSureSurrender
source: Are you sure you want to surrender the game?
es: ¿Estás seguro de que quieres rendirte?
pt: Tem certeza de que deseja se render?

source: Exit Game
es: Salir del Juego
pt: Sair do Jogo

# areYouSureExit
source: Are you sure you want to exit to the menu?
es: ¿Estás seguro de que quieres salir al menú?
pt: Tem certeza de que deseja sair para o menu?

# cardTiger
source: Tiger
es: Tigre
pt: Tigre

# cardDragon
source: Dragon
es: Dragón
pt: Dragão

# cardFrog
source: Frog
es: Rana
pt: Sapo

# cardRabbit
source: Rabbit
es: Conejo
pt: Coelho

# cardCrab
source: Crab
es: Cangrejo
pt: Caranguejo

# cardElephant
source: Elephant
es: Elefante
pt: Elefante

# cardGoose
source: Goose
es: Ganso
pt: Ganso

# cardRooster
source: Rooster
es: Gallo
pt: Galo

# cardMonkey
source: Monkey
es: Mono
pt: Macaco

# cardMantis
source: Mantis
pt: Louvadeus

# cardHorse
source: Horse
es: Caballo
pt: Cavalo

# cardOx
source: Ox
es: Buey
pt: Boi

# cardCrane
source: Crane
es: Grulla
pt: Grou

# cardBoar
source: Boar
es: Jabalí
pt: Javali

# cardEel
source: Eel
es: Anguila
pt: Enguia

source: won by capture!
es: ¡ganó por captura!
pt: venceu por captura!

source: won by temple!
es: ¡ganó por templo!
pt: venceu pelo templo!

source: Blue
es: Azul
pt: Azul

source: Red
es: Rojo
pt: Vermelho

# historyWon
source: Won
es: Ganó
pt: Venceu

# historyLost
source: Lost
es: Perdió
pt: Perdeu

# historyCanceled
source: Canceled
es: Cancelado
pt: Cancelado

# historyGameOn
source: Game on
es: Partida el
pt: Jogo em

# historyErrorLoading
source: Error loading games.
es: Error al cargar partidas.
pt: Erro ao carregar jogos.

# historyNoFinished
source: No finished games found.
es: No se encontraron partidas finalizadas.
pt: Nenhum jogo finalizado encontrado.

# historyTitle
source: Game History
pt: Histórico de Jogos

# matchResultVictoryTitle
source: Victory!
es: ¡Victoria!
pt: Vitória!

# matchResultDefeatTitle
source: Defeat
es: Derrota
pt: Derrota

# matchResultGainedPoints
source: You gained {points} rating points.
es: Ganaste {points} puntos de rating.
pt: Você ganhou {points} pontos de rating.

# matchResultLostPoints
source: You lost {points} rating points.
es: Perdiste {points} puntos de rating.
pt: Você perdeu {points} pontos de rating.

# matchResultNoChange
source: Your rating remains unchanged.
es: Tu rating no cambió.
pt: Seu rating não mudou.

# matchResultPreviousRating
source: Previous rating
es: Rating anterior
pt: Rating anterior

# matchResultNewRating
source: New rating
es: Rating actual
pt: Rating atual

# matchResultTierLabel
source: Tier
es: Rango
pt: Nível

# matchResultSeasonLabel
source: Season
es: Temporada
pt: Temporada

# loginRequiredTitle
source: Login required
es: Inicio de sesión requerido
pt: Login necessário

# loginRequiredMessage
source: You need to be logged in to play online.
es: Necesitas iniciar sesión para jugar en línea.
pt: Você precisa estar logado para jogar online.

# loginRequiredAction
source: Go to login
es: Ir al login
pt: Ir para o login

# chooseUsername
source: Choose a username to continue:
es: Elige un nombre de usuario para continuar:
pt: Escolha um nome de usuário para continuar:

source: Username
es: Nombre de usuario
pt: Nome de usuário

source: Save
es: Guardar
pt: Salvar

# usernameAlreadyExists
source: This username is already taken.
es: Este nombre de usuario ya está en uso.
pt: Este nome de usuário já está em uso.

source: Sign in with Google
es: Iniciar sesión con Google
pt: Entrar com Google

source: Sign in with Apple
es: Iniciar sesión con Apple
pt: Entrar com Apple

# moveHistoryTitle
source: Current Game History
es: Historial de la Partida
pt: Histórico da Partida

# moveHistoryMove
source: Move {number}
es: Movimiento {number}
pt: Movimento {number}

# moveHistoryFromTo
source: From: ({fromR}, {fromC}) To: ({toR}, {toC}) with {cardName}
es: De: ({fromR}, {fromC}) A: ({toR}, {toC}) con {cardName}
pt: De: ({fromR}, {fromC}) Para: ({toR}, {toC}) com {cardName}

# undoWithAd
source: Watch ad to undo
es: Ver anuncio para deshacer
pt: Assistir anúncio para desfazer

# preloadLoadingTheme
source: Loading theme...
es: Cargando tema...
pt: Carregando tema...

# preloadFetchingThemes
source: Fetching available themes...
es: Buscando temas disponibles...
pt: Buscando temas disponíveis...

# preloadPreloadingImages
source: Preloading images...
es: Pre-cargando imágenes...
pt: Pré-carregando imagens...

# preloadDownloadingImages
source: Downloading images ({done}/{total})...
es: Descargando imágenes ({done}/{total})...
pt: Baixando imagens ({done}/{total})...

# preloadDone
source: Done!
es: ¡Listo!
pt: Concluído!

# preloadImagesCount
source: {count, plural, =0{No images} =1{1 image} other{{count} images}}
es: {count, plural, =0{Sin imágenes} =1{1 imagen} other{{count} imágenes}}
pt: {count, plural, =0{Nenhuma imagem} =1{1 imagem} other{{count} imagens}}

# lobbyGameIdLabel
source: Game ID: {gameId}
es: ID de la partida: {gameId}
pt: ID do jogo: {gameId}

# lobbyGameIdCopied
source: Game ID copied to clipboard
es: ID de la partida copiado al portapapeles
pt: ID do jogo copiado para a área de transferência

# lobbyPlayersCount
source: Players: {count}/2
es: Jugadores: {count}/2
pt: Jogadores: {count}/2

# leaderboardTitle
source: Leaderboard
es: Clasificación
pt: Ranking

# leaderboardInvite
source: Play online matches to join the leaderboard!
es: ¡Juega partidas en línea para entrar en la clasificación!
pt: Jogue partidas online para entrar no ranking!

# leaderboardPlayerSummary
source: Your rank: {rating} • {tier} • {winRate}% wins
es: Tu clasificación: {rating} • {tier} • {winRate}% victorias
pt: Sua classificação: {rating} • {tier} • {winRate}% vitórias

# leaderboardEmpty
source: Be the first to reach the top!
es: ¡Sé el primero en llegar a la cima!
pt: Seja o primeiro a aparecer no topo!

# leaderboardPlayerSubtitle
source: {rating} points • {tier}
es: {rating} puntos • {tier}
pt: {rating} pontos • {tier}

# leaderboardTierSilver
source: Silver
es: Plata
pt: Prata

# leaderboardTierGold
source: Gold
es: Oro
pt: Ouro

# leaderboardTierPlatine
source: Platinum
es: Platino
pt: Platina

# leaderboardTierDiamond
source: Diamond
es: Diamante
pt: Diamante

source: Play
es: Jugar
pt: Jogar

source: Sign Out
es: Salir
pt: Sair

source: Profile
es: Perfil
pt: Perfil

source: Display Name
es: Nombre
pt: Nome

# profileChangePhoto
source: Change photo
es: Cambiar foto
pt: Alterar foto

# profileCamera
source: Camera
es: Cámara
pt: Câmera

# profileGallery
source: Gallery
es: Galería
pt: Galeria

source: Profile photo updated!
es: ¡Foto de perfil actualizada!
pt: Foto de perfil atualizada!

# profilePhotoUpdateError
source: We couldn't update your photo. Try again.
es: No pudimos actualizar tu foto. Inténtalo de nuevo.
pt: Não foi possível atualizar sua foto. Tente novamente.

# descriptionElephant
source: He will never forget those who matter most to him.
es: Nunca olvidará a aquellos que más le importan.
pt: Nunca se esquecerá daqueles que mais lhe importam.

source: Current Game History
es: Historial de la Partida Actual
pt: Histórico da Partida Atual

# descriptionTiger
source: Strong and courageous, he fiercely protects his home.
es: Fuerte y valiente, protege su hogar con fervor.
pt: Forte e corajoso, ele protege seu lar com fervor.

# descriptionDragon
source: With ancient wisdom, he guards the secrets of the heavens.
es: Con sabiduría ancestral, guarda los secretos de los cielos.
pt: Com sabedoria ancestral, ele guarda os segredos dos céus.

# descriptionFrog
source: The frog's calmness hides a predator's agility.
es: La calma del sapo esconde la agilidad de un depredador.
pt: A calma do sapo esconde a agilidade de um predador.

# descriptionRabbit
source: His cunning and speed help him overcome any obstacle.
es: Su astucia y velocidad le ayudan a superar cualquier obstáculo.
pt: Sua astúcia e velocidade o ajudam a superar qualquer obstáculo.

# descriptionCrab
source: His strength and resilience make him a warrior of the sea.
es: Su fuerza y resistencia lo convierten en un guerrero del mar.
pt: A sua força e resiliência o tornam um guerreiro do mar.

# descriptionGoose
source: With loyalty and bravery, he defends those he loves.
es: Con lealtad y bravura, defiende a quienes ama.
pt: Com lealdade e bravura, ele defende aqueles que ama.

# descriptionRooster
source: His crow heralds the arrival of a new day, full of energy.
es: Su canto anuncia la llegada de un nuevo día, lleno de energía.
pt: Seu canto anuncia a chegada de um novo dia, cheio de energia.

# descriptionMonkey
source: Intelligent and playful, he explores life with curiosity.
es: Inteligente y juguetón, explora la vida con curiosidad.
pt: Inteligente e brincalhão, ele explora a vida com curiosidade.

# descriptionMantis
source: Patience and precision are his weapons in the forest.
es: Paciencia y precisión son sus armas en el bosque.
pt: Paciência e precisão são suas armas na floresta.

# descriptionHorse
source: Freedom and strength guide his wild spirit.
es: La libertad y la fuerza guían su espíritu salvaje.
pt: A liberdade e a força guiam seu espírito selvagem.

# descriptionOx
source: A symbol of labor and persistence, he ensures sustenance.
es: Símbolo de trabajo y persistencia, garantiza el sustento.
pt: Símbolo de trabalho e persistência, ele garante o sustento.

# descriptionCrane
source: His elegance and grace inspire harmony and longevity.
es: Su elegancia y gracia inspiran armonía y longevidad.
pt: Sua elegância e graça inspiram a harmonia e a longevidade.

# descriptionBoar
source: Determined and fearless, he faces the challenges of the forest.
es: Determinado y audaz, se enfrenta a los desafíos del bosque.
pt: Determinado e destemido, ele enfrenta os desafios da floresta.

# descriptionEel
source: Subtle and agile, she navigates the depths with skill.
es: Sutil y ágil, navega por las profundidades con destreza.
pt: Sutil e ágil, ela navega pelas profundezas com destreza.

# descriptionCobra
source: With its millenary wisdom, it observes the world in silence.
es: Con su sabiduría milenaria, observa el mundo en silencio.
pt: Com sua sabedoria milenar, ela observa o mundo em silêncio.

source: Start Game
es: Iniciar Juego
pt: Iniciar Jogo

# tutorialSkip
source: Skip
pt: Pular

# tutorialMenuPlayTitle
source: Start a match
pt: Comece uma partida

# tutorialMenuPlayDescription
source: Open the play menu to find online games, bots, or private rooms.
pt: Abra o menu de jogo para buscar partidas online, bots ou salas privadas.

# tutorialMenuLeaderboardTitle
source: Leaderboard
pt: Ranking

# tutorialMenuLeaderboardDescription
source: Check the masters and see where you stand.
pt: Veja os mestres e a sua posição.

# tutorialMenuHowToPlayTitle
source: Learn the rules
pt: Aprenda as regras

# tutorialMenuHowToPlayDescription
source: Open the guide whenever you need a refresher.
pt: Abra o guia sempre que precisar relembrar alguma coisa.

# tutorialMenuProfileTitle
source: Profile & login
pt: Perfil e login

# tutorialMenuProfileDescription
source: Sign in, edit your avatar, or access account options here.
pt: Entre na conta, edite seu avatar ou acesse opções da conta aqui.

# tutorialMenuVolumeTitle
source: Sound
pt: Som

# tutorialMenuVolumeDescription
source: Adjust music, sound effects, or mute the game.
pt: Ajuste músicas, efeitos ou silencie o jogo.

# tutorialPlayMenuStartTitle
source: Instant matchmaking
pt: Partida rápida

# tutorialPlayMenuStartDescription
source: Find an online opponent automatically.
pt: Encontre um adversário online automaticamente.

# tutorialPlayMenuPvpTitle
source: Local PvP
pt: PvP local

# tutorialPlayMenuPvpDescription
source: Challenge a friend on the same device.
pt: Desafie um amigo no mesmo dispositivo.

# tutorialPlayMenuAiTitle
source: Practice vs AI
pt: Treinar vs IA

# tutorialPlayMenuAiDescription
source: Battle different difficulties to sharpen your skills.
pt: Enfrente dificuldades diferentes para praticar.

# tutorialPlayMenuPrivateTitle
source: Private rooms
pt: Salas privadas

# tutorialPlayMenuPrivateDescription
source: Create or join a match with a shareable code.
pt: Crie ou entre em partidas usando um código compartilhado.

# tutorialGameplayPlayerCardsTitle
source: Your cards
pt: Suas cartas

# tutorialGameplayPlayerCardsDescription
source: Each duel uses five of the 16 movement cards. These two show the moves you can play now.
pt: Cada duelo usa cinco das 16 cartas de movimento. Estas duas mostram os movimentos disponíveis agora.

# tutorialGameplayOpponentCardsTitle
source: Opponent cards
pt: Cartas do oponente

# tutorialGameplayOpponentCardsDescription
source: Keep track of the moves your rival can choose next.
pt: Observe os movimentos que seu rival poderá escolher a seguir.

# tutorialGameplayBoardTitle
source: Board & pieces
pt: Tabuleiro e peças

# tutorialGameplayBoardDescription
source: Move students or your master. Capture the enemy master or reach their temple to win.
pt: Movimente estudantes ou o mestre. Capture o mestre inimigo ou alcance o templo dele para vencer.

# tutorialGameplayReserveTitle
source: Reserve card
pt: Carta reserva

# tutorialGameplayReserveDescription
source: When you play a card it enters the reserve and you take this one, so cards constantly rotate.
pt: Ao usar uma carta ela vem para cá e você pega esta, mantendo a rotação dos movimentos.

# leaderboardTierBronze
source: Bronze
es: Bronce
